National_bank_xml/PRISTIGAO_RTGS.XML

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns3:getStrukturaRtgsNalogaRequest xmlns:ns2="http://nalogZaPlacanje.com" xmlns:ns3="http://strukturaRtgsNaloga.com" xmlns:ns4="http://mt102.BankXml.bankXml.example.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>hh/JVhwMTZXKUQK+5lrmXxcolxcUs/6E6DBJT6jxVl5oe6sPhLsYLBQClx0bASebAi1qP9xkUtAJ&#13;
Nz5zJF0ZJh6+KQxCqwTFssEi5EgOSF4A/p5xt8NsC2KIWlyKbvSZxx3sbtWjjzB8Suc2MBbVJZGW&#13;
j25Bp25hzfMnB5eveps=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>hsrFKqFcTsDCBV7K3yPH39kgodFHdEI97eMUZMlQInDSnZJvDJUjLdRJQ/4h5Ap6uaw+t1xz1cfm&#13;
bVNBlNtbGoy8a9KPIrSqFpAqYe/amVdjIgSC4IP73F2Ty8cIyIEPw/4dEJPtDO8JgjpGEER9SgtS&#13;
uFw8KJRYIu5KtXo1KwCKA3v7fhiaW6KjCtQ5VBhDBAk9TxQPfW0xyI3bknkCnLBA/5d+Au28iEpy&#13;
GFhVbgFrxHM1vdr6pwvtjgBaTmnB0b8XZVNZ63wbEIxHDU1T1GmL2cHCQGdMn43BQug0AhnfVAl+&#13;
8E4Clx/5DRSgCxZRerlq0480YCtBTi9W8WAclhr3RypYuNSEwKFsJ7VYHxsiR4xUYy+5LCV6EvkZ&#13;
JajHDGCUXCtx73svmQT+vlJoOYzXoCppt26xwVRsTI9/VlAe5j4BJ8AswRzZswMBFt8AGJV0AY5P&#13;
kaRF85hddxSxaHSdDp2B34v2k4QneoWJfuFmrRuLqXTj4Oy0anYUd7A0oTeBIgfz21DaOe6obDQF&#13;
xZO8pVDx1f68BJNOgsHHxQCphkXotbzA6t62HP2s+BshDmCmULuZxsOfE3lfEVuuwLYQGMjVvY/t&#13;
ABMCOHb2QVdp3ZjeXCmvBgnctldWDRHGimzYrTM+4qjmw5H/nUvmsj1yJyenCeuT+EKpRXgX/HE0&#13;
lU4IXQ5HsHzPM/bMRv0SXEAnb6PCh21tYIitqijvehfmPmgybeblOGfjBDT1Vg5xdJ5R9F+QEqHe&#13;
Ugy+YgjfqU8akeLXRPRpxLSOPuPyzyK1rG0emsOsY9kecnw1Fsx7frYV3Od928/TKwCyTef73j5x&#13;
lRKjFnf9F1V1friHRSxUB313BtKwr2s91y82qLnD0UMuEQ6fOYVoJXgmuMiHVnmA1ziPv6B/7zkr&#13;
6oN+CS+NmYJZ3NXSA641BKLYm43tndyCntQjw8LuaCaT2F/41tKAPqxAYj8VuGZhbzCW0nqiIr4q&#13;
f7OAkXUzthiFiYXrYm9er9dQWzR06ETwanq/2K8ftShBkKs5kET5g91Zl445lnv9Te42Zjyix9JX&#13;
GyabHIZUGcj7HMNx2psMg9JD7ZK+WfKKeu2eglf355qPi8ciQLLzqCSZZKWznsIg0qtCMGLkfWWV&#13;
W8zSJNNXsm6xuPwmk0qdWVI5elNkmMqz2UMdOTBXXl5fB9flNuTpOZQiAcm7qj3dfvfIshkAgBDg&#13;
CiJ7zPBhAhs3y2ksu8Y6h25cxkGejgCN12eg69YlDMzfxLHcIsbMVSNZiLShzG/gf5Pwa9LrzGy0&#13;
VhVYvD4inyXRFj4nH0H6r0NeSZC9Vx5h/AjxwGTwqokxnGuhNGJwoJOQX04gHcJowvd/a7FBYg==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns3:getStrukturaRtgsNalogaRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>dbKaEEDTsNMi6kSx4eJv2BqH6ek=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
UWo1y1HNytkVf3vwhiEyN/1YhEsK5ZQJAJvsvHeKouTShg6IYkGBmhiGPk/6fwzSzQP2mrrip/1j&#13;
g9DmSmw7DackynwkDSTu7p5fTcDpnhnoNnOY/ArmCu7pfX1pfp0nu/zWNUSzF4NbGda7HgdfYlws&#13;
cZlRRJCvX9kb4qyPaw8=
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
zQ9KJLShafi/S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OX&#13;
fbX4v6KTKJ4ug0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2&#13;
EZgUl90oEpTRbV+xX8E=
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIBtjCCAR8CBEZasCQwDQYJKoZIhvcNAQEFBQAwIjEPMA0GA1UECwwGcHJpbWVyMQ8wDQYDVQQD&#13;
DAZwcmltZXIwHhcNMDcwNTI4MTAzNDEyWhcNMjcwNTIzMTAzNDEyWjAiMQ8wDQYDVQQLDAZwcmlt&#13;
ZXIxDzANBgNVBAMMBnByaW1lcjCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAzQ9KJLShafi/&#13;
S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OXfbX4v6KTKJ4u&#13;
g0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2EZgUl90oEpTR&#13;
bV+xX8ECAwEAATANBgkqhkiG9w0BAQUFAAOBgQB2HjPI427zRaVfLTaeNVcjH9hoTkl9OUJAAmEa&#13;
6EQdbdqZ75ca3IfuLHJFJ8zzyBP4LUGSxgA4OpnKs6Ej5w2n0GHmu0g4YqxInfpv/kCwswoia4Oz&#13;
a17te8mMamffCn3ySX5yZzEex5nueNAyhJkmWBcBCOvJw4+U+gSK50Xbcw==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>